# [3.3. Алгоритмы](https://education.yandex.ru/handbook/cpp/article/algorithms)
## A. Удвоить вектор
Требуется написать шаблонную функцию Duplicate, которая получает на вход вектор и дублирует все его элементы в конце вектора. Например, из вектора с элементами 1, 2, 3 должен получиться вектор с элементами 1, 2, 3, 1, 2, 3. Вася написал вот такую реализацию, которая почему-то не работает:  
```
#include <vector>

template <typename T>
void Duplicate(std::vector<T>& v) {
    for (auto it = v.begin(); it != v.end(); ++it) {
        v.push_back(*it);
    }
}
```
Вам надо исправить код Васи.  

**Примечание**  
Сдайте в систему только исправленный код функции Duplicate без функции main. Подключите все необходимые для вашей реализации библиотеки. Заголовок функции Вася написал правильно, в этом можете не сомневаться.  

---
```c++
#include <vector>

template <typename T>
void Duplicate(std::vector<T>& v) {
    v.reserve(v.size() * 2);
    std::copy(v.begin(), v.end(), std::back_inserter(v));
}
```

## B. Алгоритм unique
Вам надо написать свою реализацию стандартного алгоритма unique. Заголовок функции должен быть таким:  
```
template <typename Iter>
Iter Unique(Iter first, Iter last);
```
Функция должна переупорядочить элементы диапазона [first; last) так, чтобы подряд идущие одинаковые элементы в ней не встречались. Функция возвращает итератор за последний элемент итоговой последовательности. Что останется в пределах от этого вернувшегося итератора до старого last — не важно. Время работы функции должно линейно зависеть от длины диапазона.  

**Примечание**  
В вашем решении должен быть только код этой шаблонной функции и не должно быть функции main. Использовать вызов std::unique нельзя.  

---
```c++
template <typename Iter>
Iter Unique(Iter first, Iter last) {
    auto it1 = first;
    auto it2 = first;
    while (it2 != last) {
        if (it1 != it2) {
            *it1 = std::move(*it2);
        }
        ++it1;
        const auto& value = *it2;
        while (it2 != last && *it2 == value) {
            ++it2;
        }
    }
    return it1;
}
```

## D. Приближённый двоичный поиск
В этой задаче нужно применить функцию std::lower_bound и итераторы для быстрого поиска ближайшего элемента в отсортированном массиве.  

**Формат ввода**  
В первой строке входных данных содержатся натуральные числа n и k, не превосходящие 100000. Во второй строке задаются целых n чисел первого массива, отсортированного по неубыванию, а в третьей строке – k целых чисел второго массива. Каждое число в обоих массивах по модулю не превосходит 2 ⋅ 10^9 . Второй массив, в отличие от первого, не отсортирован.  
**Формат вывода**  
Для каждого из k чисел выведите в отдельной строке число из первого массива, наиболее близкое к данному. Если таких несколько, выведите меньшее из них.  

---
```c++
#include <algorithm>
#include <iostream>
#include <vector>
#include <utility>

int main() {
    size_t n, k;
    std::cin >> n >> k;
    std::vector<int> v1;
    std::vector<int> v2;
    v1.reserve(n), v2.reserve(k);
    for (size_t i = 0; i != n; ++i) {
        int num;
        std::cin >> num;
        v1.push_back(num);
    }

    for (size_t i = 0; i != k; ++i) {
        int num;
        std::cin >> num;
        v2.push_back(num);
    }
    
    for (auto i = v2.begin(); i != v2.end(); ++i) {
        auto it1 = std::lower_bound(v1.begin(), v1.end(), *i);
        if (it1 == v1.end()) {
            std::cout << *prev(v1.end()) << std::endl;
        } else if (*i == *it1) {
            std::cout << *i << std::endl;
        } else if (v1.begin() == it1) {
            std::cout << *it1 << std::endl;
        } else {
            auto it2 = prev(it1);
            if (*it1 - *i >= *i - *it2) {
                std::cout << *it2 << std::endl;
            } else {
            std::cout << *it1 << std::endl;
            }
        }
    }
    return 0;
}
```

## E. Функция Process
Андрею надо написать шаблонную функцию Process, которая обрабатывает вектор с числами некоторого типа T. Его функция должна вызвать другую функцию PrintResults, чтобы напечатать с определенным форматированием положительные числа из вектора. Функция PrintResults принимает на вход пару итераторов, как и многие алгоритмы стандартной библиотеки. Поэтому Андрей решил сначала скопировать нужные элементы исходного вектора в другой массив, чтобы передать его начало и конец в эту функцию. Вот код Андрея:  

```
#include <algorithm>
#include <vector>

template <typename T>
void Process(const std::vector<T>& data) {
    std::vector<T> filtered;

    auto filteredLast = std::copy_if(
        data.begin(),
        data.end(),
        filtered.begin(),
        [](const T& x) { return x > 0; }
    );

    PrintResults(filtered.begin(), filteredLast);
}
```

Этот код почему-то не работает. Найдите ошибку и сдайте исправленное решение.  

**Примечание**  
Вам нужно сдать только исправленный код Андрея. В вашей программе не должно быть функции main.  

---
```c++
#include <algorithm>
#include <iostream>
#include <vector>

template <typename T>
void Process(const std::vector<T>& data) {
    std::vector<T> filtered(size(data));

    auto filteredLast = std::copy_if(
        data.begin(),
        data.end(),
        filtered.begin(),
        [](const T& x) { return x > 0; }
    );
    PrintResults(filtered.begin(), filteredLast);
}
```
