# [3.4. Адаптеры и представления](https://education.yandex.ru/handbook/cpp/article/adapters-and-views)

## C. Очередь с приоритетами
Напишите программу, которая будет обрабатывать последовательность запросов таких видов:  

1. CLEAR — сделать очередь с приоритетами пустой (если в очереди уже были какие-то элементы, то удалить все).  

2. ADD n — добавить в очередь с приоритетами число n (вмещается в стандартный тип int).  

3. EXTRACT — вынуть из очереди с приоритетами максимальное значение. Следует изменить данные в памяти и вывести на экран найденное максимальное значение, или, если очередь была пустой, слово CANNOT.  

**Формат ввода**  
Во входных данных записана произвольная последовательность запросов CLEAR, ADD и EXTRACT — каждый в отдельной строке. Суммарное количество всех запросов не превышает 200000.  

**Формат вывода**  
Для каждого запроса типа EXTRACT выведите его результат в отдельной строке.  

---
```c++
#include <iostream>
#include <queue>
#include <string>

int main() {
    std::priority_queue<int> pq;
    std::string comm;
    while (std::cin >> comm) {
        if (comm == "CLEAR") {
            pq = std::priority_queue<int>();
        } else if (comm == "ADD") {
            int n;
            std::cin >> n;
            pq.push(n);
        } else if (comm == "EXTRACT") {
            if (pq.empty()) {
                std::cout << "CANNOT" << "\n";
                continue;
            }
            std::cout << pq.top() << "\n";
            pq.pop();
        }
    }
    return 0;            
}
```

## D. Next token
Вам надо написать функцию NextToken для выделения очередного токена в строке. Токеном считается последовательность символов до указанного символа-разделителя (или до конца строки).  

Использоваться функция будет примерно так:  

```
int main() {
    std::string_view sv = "Hello world and good bye";

    const char delimiter = ' ';
    std::string_view token;

    // Делим строку на токены по разделителю и перебираем эти токены:
    while (NextToken(sv, delimiter, token)) {
        // обрабатываем очередной token
        // например, печатаем его на экране:
        std::cout << token << "\n";
    }
}
```

Результатом выполнения такой программы будет  

```
Hello
world
and
good
bye
```

Сдайте только код функции NextToken и подключите необходимые библиотеки. Ваша функция будет скомпилирована с нашей функцией main. Гарантируется, что входная строка не заканчивается на разделитель. Догадайтесь сами, какие аргументы должна принимать функция NextToken. Эта функция может менять первый аргумент (sv).  

---
```c++
#include <iostream>
#include <string>

bool NextToken(std::string_view& sv, const char& del, std::string_view& token) {
    if (sv.empty()) {
        return false;
    }
    else if (sv.find(del) == std::string::npos) {
        token = sv;
        sv = "";
        return true;
    }
    token = sv.substr(0, sv.find(del));
    sv = sv.substr(token.size() + 1);
    return true;
}
```

## E. Самые частотные слова
Выведите k самых частотных слов текста и их частоты.  

**Формат ввода**  
В первой строке указано натуральное число k, не превосходящее 1000. Далее идут строки текста объёмом до 1 Mб. Слова в тексте разделены пробелами или переводами строк. Различать регистр и обрабатывать пунктуацию не нужно.  

**Формат вывода**  
В выводе должно быть не более k самых частотных слов текста. Через табуляцию после слова напечатайте его частоту. Слова должны быть упрядочены по убыванию частоты, а при равенстве частот — по алфавиту.  

---
```c++
#include <algorithm>
#include <iostream>
#include <map>
#include <string>
#include <tuple>
#include <vector>

int main() {
    std::map<std::string, int> m;
    size_t k;
    std::string word;
    std::cin >> k;
    while (std::cin >> word) {
        ++m[word];
    }
    std::vector<std::pair<std::string, int>> p(m.begin(), m.end());
    std::sort(p.begin(), p.end(),
        [](const auto& p1, const auto& p2){return std::tie(p2.second, p1.first) < std::tie(p1.second, p2.first);});
    
    for (const auto& it : p) {
        if (k) {
            std::cout << it.first << '\t' << it.second << '\n';
            --k;
        } else {
            break;
        }
    }
    return 0;
}
```
